/* Задание на урок:

1) Автоматизировать вопросы пользователю про фильмы при помощи цикла

2) Сделать так, чтобы пользователь не мог оставить ответ в виде пустой строки,
отменить ответ или ввести название фильма длинее, чем 50 символов. Если это происходит - 
возвращаем пользователя к вопросам опять

3) При помощи условий проверить  personalMovieDB.count, и если он меньше 10 - вывести сообщение
"Просмотрено довольно мало фильмов", если от 10 до 30 - "Вы классический зритель", а если больше - 
"Вы киноман". А если не подошло ни к одному варианту - "Произошла ошибка"

4) Потренироваться и переписать цикл еще двумя способами*/

'use strict';

// Код возьмите из предыдущего домашнего задания
let i = 0;
do {
    const a = prompt(`Kakoy posledniy film? ${i}`, ""),
          b = prompt('Vasha ocenka: ', "");
    if (a !=null && b != null && a.length < 50 && a !== '' && b !==''){
        console.log('done');
        i++;
    } else{
        console.log('error');
        i--;
    }
} while (i < 2);